VerySmall/C100/c100-go.log
Finished 84995 requests


Server Software:        nginx/1.10.3
Server Hostname:        <redacted>
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
TLS Server Name:        <redacted>

Document Path:          <redacted>
Document Length:        76 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      84995
Failed requests:        0
Keep-Alive requests:    84200
Total transferred:      24134605 bytes
HTML transferred:       6459620 bytes
Requests per second:    1416.57 [#/sec] (mean)
Time per request:       70.593 [ms] (mean)
Time per request:       0.706 [ms] (mean, across all concurrent requests)
Transfer rate:          392.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  74.5      0    3368
Processing:    11   66  94.9     35    1828
Waiting:       10   66  94.9     35    1828
Total:         11   70 123.5     35    3409

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     44
  75%     52
  80%     63
  90%    200
  95%    253
  98%    452
  99%    469
 100%   3409 (longest request)